# IsReversed Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarUpdateCurvesData..::..IsReversed Property
RebarUpdateCurvesData Class See Also
---
Used to store the state of the bar refering to the direction of the bars. This is useful when using face intersection to calculate bars. After mirroring, curves created from intersecting faces may be reversed, so we use this to store the state and keep the rebar pointing in the correct direction.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public bool IsReversed { get; set; }
```

Visual Basic
---
```text
Public Property IsReversed As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool IsReversed {
	bool get ();
	void set (bool value);
}
```

# See Also
RebarUpdateCurvesData Class
Autodesk.Revit.DB.Structure Namespace